In [2]:
import numpy as np
import pandas as pd

In [17]:
np.random.seed(0)
prod_sales = np.random.randint(30, size=(5,4))
prod_sales.shape
prod_sales

array([[12, 15, 21,  0],
       [ 3, 27,  3,  7],
       [ 9, 19, 21, 18],
       [ 4, 23,  6, 24],
       [24, 12, 26,  1]])

In [13]:
prod_prices = np.array([2300,3200,1400,2500])
prod_prices.shape

(4,)

In [24]:
# creacion de dataframes
weekly_sales = pd.DataFrame(prod_sales,
                            index=["M","T","W","T","F"],
                           columns=["Holland Cheesse","Dutch Cheesse","Costa Rican Cheesse","Norsk Cheesse"])
weekly_sales

   Holland Cheesse  Dutch Cheesse  Costa Rican Cheesse  Norsk Cheesse
M               12             15                   21              0
T                3             27                    3              7
W                9             19                   21             18
T                4             23                    6             24
F               24             12                   26              1

In [25]:
chesse_prices = pd.DataFrame(prod_prices.reshape(1,4),
                            index=["Cheesse prices"],
                            columns=["Holland Cheesse","Dutch Cheesse","Costa Rican Cheesse","Norsk Cheesse"])
chesse_prices

,Holland Cheesse,Dutch Cheesse,Costa Rican Cheesse,Norsk Cheesse
Cheesse prices,2300,3200,1400,2500

In [30]:
# ver ambas:
print(weekly_sales)
print("------------------------------------")
print(chesse_prices)

   Holland Cheesse  Dutch Cheesse  Costa Rican Cheesse  Norsk Cheesse
M               12             15                   21              0
T                3             27                    3              7
W                9             19                   21             18
T                4             23                    6             24
F               24             12                   26              1
------------------------------------
                Holland Cheesse  Dutch Cheesse  Costa Rican Cheesse  \
Cheesse prices             2300           3200                 1400

                Norsk Cheesse
Cheesse prices           2500

In [36]:
# total
total = prod_prices.dot(prod_sales.T)
total

array([105000, 115000, 155900, 151200, 132500])

In [42]:
# daily sales
chesse_prices.shape, weekly_sales.shape

((1, 4), (5, 4))

In [45]:
daily_total = chesse_prices.dot(weekly_sales.T)
daily_total

                     M       T       W       T       F
Cheesse prices  105000  115000  155900  151200  132500

In [47]:
weekly_sales

   Holland Cheesse  Dutch Cheesse  Costa Rican Cheesse  Norsk Cheesse
M               12             15                   21              0
T                3             27                    3              7
W                9             19                   21             18
T                4             23                    6             24
F               24             12                   26              1

In [50]:
weekly_sales["Total $"] = daily_total.T
weekly_sales

   Holland Cheesse  Dutch Cheesse  Costa Rican Cheesse  Norsk Cheesse  Total $
M               12             15                   21              0   105000
T                3             27                    3              7   115000
W                9             19                   21             18   155900
T                4             23                    6             24   151200
F               24             12                   26              1   132500